Aim: Configure IP SLA Tracking and Path Control Topology.
Router R1
interface Loopback 0
ip address 192.168.1.1 255.255.255.0
interface Serial1/0
ip address 209.165.201.2 255.255.255.252
no shutdown 
interface Serial1/1
ip address 209.165.202.130 255.255.255.252
no shutdown
interface Loopback0
ip address 209.165.200.254 255.255.255.255
interface Loopback1
ip address 209.165.201.30 255.255.255.255
interface Serial1/0
ip address 209.165.201.1 255.255.255.252
no shutdown interface Serial1/1
ip address 209.165.200.225 255.255.255.252
no shutdown

interface Loopback0
ip address 209.165.200.254 255.255.255.255
interface Loopback1
ip address 209.165.202.158 255.255.255.255
interface Serial1/0 description ISP2 --> R1
ip address 209.165.202.129 255.255.255.252
no shutdown interface Serial1/1
ip address 209.165.200.226 255.255.255.252
no shutdown






R1# show interfaces description
ip route 0.0.0.0 0.0.0.0 209.165.201.1
Router ISP1 (R2)
router eigrp 1
network 209.165.200.224 0.0.0.3
network 209.165.201.0 0.0.0.31
no auto-summary
ip route 192.168.1.0 255.255.255.0 209.165.201.2
Router ISP2 (R3)
router eigrp 1
network 209.165.200.224 0.0.0.3
network 209.165.202.128 0.0.0.31
no auto-summary
ip route 192.168.1.0 255.255.255.0 209.165.202.130
R1(tcl)# foreach address {
+>(tcl)# 209.165.200.254
+>(tcl)# 209.165.201.30
+>(tcl)# 209.165.202.158
+>(tcl)# } { ping $address source 192.168.1.1 }

R1(tcl)# foreach address {
+>(tcl)# 209.165.200.254
+>(tcl)# 209.165.201.30
+>(tcl)# 209.165.202.158
+>(tcl)# } { trace $address source 192.168.1.1 }
R1(config)# ip sla 11
R1(config-ip-sla)# icmp-echo 209.165.201.30 R1(config-ip-sla-echo)# frequency 10 R1(config-ip-sla-echo)# exit
R1(config)# ip sla schedule 11 life forever start-time now
 


R1# show ip sla configuration 11
R1#show ip sla statistics
R1# show ip sla configuration 22
R1(config)# no ip route 0.0.0.0 0.0.0.0 209.165.201.1 R1(config)# ip route 0.0.0.0 0.0.0.0 209.165.201.1 5
R1(config)# exit
R1# show ip route
R1(config)# track 1 ip sla 11 reachability R1(config-track)#
R1# debug ip routing
R1(config)# ip route 0.0.0.0 0.0.0.0 209.165.201.1 2 track 1
ip route 0.0.0.0 0.0.0.0 209.165.202.129 3 track 2
R1# show ip route
ISP1(config)# interface loopback 1 ISP1(config-if)# shutdown
R1# show ip sla statistics
R1# trace 209.165.200.254 source 192.168.1.1
 R1# show ip sla statistics


Practical 2
Aim: Using the AS_PATH Attribute.

Andheri(config)# interface Loopback0
Andheri(config-if)# ip address 10.1.1.1 255.255.255.0 Andheri(config-if)# exit
Andheri(config)# interface Serial1/0
Andheri(config-if)# ip address 192.168.1.5 255.255.255.252 Andheri(config-if)# no shutdown
Andheri(config-if)# end Andheri#
Router R2 (hostname Bandra)
Bandra(config)# interface Loopback0
Bandra(config-if)# ip address 10.2.2.1 255.255.255.0 Bandra(config-if)# interface Serial0/0/0
Bandra(config-if)# ip address 192.168.1.6 255.255.255.252 Bandra(config-if)# no shutdown
Bandra(config-if)# exit Bandra(config)# interface Serial1/1
Bandra(config-if)# ip address 172.24.1.17 255.255.255.252 Bandra(config-if)# no shutdown
Bandra(config-if)# end Bandra#

Router R3 (hostname ChurchGate) Churchgate(config)# interface Loopback0 Churchgate(config-if)# ip address 10.3.3.1 255.255.255.0 Churchgate(config-if)# exit
Churchgate(config)# interface Serial1/1
Churchgate(config-if)# ip address 172.24.1.18 255.255.255.252 Churchgate(config-if)# no shutdown
Churchgate(config-if)# end
Churchgate#

Andheri(config)# router bgp 100
Andheri(config-router)# neighbor 192.168.1.6 remote-as 300 Andheri(config-router)# network 10.1.1.0 mask 255.255.255.0
Bandra(config)# router bgp 300
Bandra(config-router)# neighbor 192.168.1.5 remote-as 100 Bandra(config-router)# neighbor 172.24.1.18 remote-as 65000 Bandra(config-router)# network 10.2.2.0 mask 255.255.255.0
Churchgate(config)# router bgp 65000
Churchgate(config-router)# neighbor 172.24.1.17 remote-as 300 Churchgate(config-router)# network 10.3.3.0 mask 255.255.255.0
Bandra# show ip bgp neighbors
Andheri#show ip route
ping 10.3.3.1 source 10.1.1.1 or ping 10.3.3.1 source Lo0
Andheri# show ip bgp
Bandra(config)# ip as-path access-list 1 deny ^100$ Bandra(config)# ip as-path access-list 1 permit .*
Bandra(config)# router bgp 300
Bandra (config-router)# neighbor 192.168.1.5 remove-private-as
Andheri# show ip route
Bandra# show ip bgp regexp ^100$









